**`teams/oasys/oracle_db`** terragrunt plan on `pull_request` event [#62](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 1s
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/oasys-oracle-db" -> (known after apply)
      ~ date_created                     = "2023-02-28T17:03:21.415Z" -> (known after apply)
      ~ date_last_run                    = "2023-03-02T12:24:27.864Z" -> (known after apply)
      ~ date_next_run                    = "2023-04-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-02-28T17:03:21.415Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/oasys-oracle-db" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/oasys-oracle-db/0.0.2" -> (known after apply) # forces replacement
        name                             = "oasys_oracle_db"
      ~ platform                         = "Linux" -> (known after apply)
        tags                             = {
            "application"                  = "OASYS"
            "branch"                       = "main"
            "business-unit"                = "HMPPS"
            "image-pipeline"               = "oasys_oracle_db"
            "image-recipe"                 = "oasys_oracle_db/0.0.2"
            "infrastructure-configuration" = "oasys_oracle_db/0.0.2"
            "is-production"                = "true"
            "os-version"                   = "rhel 8.5"
            "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"             = "release"
            "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/oasys"
            "update-linux-version"         = "1.0.2"
        }
        # (6 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/oasys-oracle-db/0.0.2" -> (known after apply)
      ~ date_created      = "2023-02-28T17:03:19.069Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/oasys-oracle-db/0.0.2" -> (known after apply)
        name              = "oasys_oracle_db"
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Linux" -> (known after apply)
        tags              = {
            "application"                  = "OASYS"
            "branch"                       = "main"
            "business-unit"                = "HMPPS"
            "image-pipeline"               = "oasys_oracle_db"
            "image-recipe"                 = "oasys_oracle_db/0.0.2"
            "infrastructure-configuration" = "oasys_oracle_db/0.0.2"
            "is-production"                = "true"
            "os-version"                   = "rhel 8.5"
            "owner"                        = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"             = "release"
            "source-code"                  = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/oasys"
            "update-linux-version"         = "1.0.2"
        }
      ~ user_data_base64  = "" -> (known after apply)
      - working_directory = "" -> null
        # (4 unchanged attributes hidden)

      + block_device_mapping { # forces replacement
          + device_name = "/dev/sdb"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }
      + block_device_mapping { # forces replacement
          + device_name = "/dev/sdc"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 500
              + volume_type           = "gp3"
            }
        }
      + block_device_mapping { # forces replacement
          + device_name = "/dev/sde"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 200
              + volume_type           = "gp3"
            }
        }
      + block_device_mapping { # forces replacement
          + device_name = "/dev/sdj"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 50
              + volume_type           = "gp3"
            }
        }

      ~ component {
            # (1 unchanged attribute hidden)

          - parameter { # forces replacement
              - name  = "Branch" -> null
              - value = "main" -> null
            }
          + parameter { # forces replacement
              + name  = "Branch"
              + value = "oasys-db"
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```
